2022-05-28-030619-star_intel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>star intel</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">star intel</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#ID-b2c6d9ca-f491-4777-a235-8cd04bb79d53">StarIntel</a></li>
<li><a href="#ID-62f255d7-63e9-4528-afb1-7e0437c742c7"><span class="todo TODO">TODO</span> Guides and Tutorials :starintel: <code>[0/5]</code></a>
<ul>
<li><a href="#ID-b53837e3-045c-4344-aa45-83b1d9cd3aa5">IDEA How to create your first document and upload</a></li>
<li><a href="#ID-bbc24929-db42-484a-ab9d-8fd1d89dc71e">IDEA Parsing a simple CSV file</a></li>
<li><a href="#ID-9f9fdbb3-a85e-4636-ad50-15b95d9d992d">IDEA Setup a Starintel server</a></li>
<li><a href="#ID-a4379236-7926-4ef3-9087-5e08ce4608fd">IDEA Project: Scrape a website and store results</a></li>
<li><a href="#ID-4a65d027-6e58-47b9-a0ae-5334a39465cf">IDEA Basic SkipTrace guide</a></li>
</ul>
</li>
<li><a href="#ID-725ef08c-4d55-433c-9c0d-64bca7d251f2"><span class="todo TODO">TODO</span> Guide on how to setup the enviroment</a></li>
<li><a href="#ID-5758e175-38f8-4801-aaad-355f31553ab3">Links to Stuff that made this possible</a></li>
</ul>
</div>
</div>
<div id="outline-container-ID-b2c6d9ca-f491-4777-a235-8cd04bb79d53" class="outline-2">
<h2 id="ID-b2c6d9ca-f491-4777-a235-8cd04bb79d53">StarIntel</h2>
<div class="outline-text-2" id="text-org09be606">
<p>
Star intel is a framework for mapping and collecting personable identifiable information and making it searchable.
</p>
</div>
</div>

<div id="outline-container-ID-62f255d7-63e9-4528-afb1-7e0437c742c7" class="outline-2">
<h2 id="ID-62f255d7-63e9-4528-afb1-7e0437c742c7"><span class="todo TODO">TODO</span> Guides and Tutorials :starintel: <code>[0/5]</code></h2>
<div class="outline-text-2" id="text-org5b48247">
</div>
<div id="outline-container-ID-b53837e3-045c-4344-aa45-83b1d9cd3aa5" class="outline-3">
<h3 id="ID-b53837e3-045c-4344-aa45-83b1d9cd3aa5">IDEA How to create your first document and upload</h3>
<div class="outline-text-3" id="text-org9704dfc">
</div>
</div>
<div id="outline-container-ID-bbc24929-db42-484a-ab9d-8fd1d89dc71e" class="outline-3">
<h3 id="ID-bbc24929-db42-484a-ab9d-8fd1d89dc71e">IDEA Parsing a simple CSV file</h3>
<div class="outline-text-3" id="text-org134e1af">
</div>
</div>
<div id="outline-container-ID-9f9fdbb3-a85e-4636-ad50-15b95d9d992d" class="outline-3">
<h3 id="ID-9f9fdbb3-a85e-4636-ad50-15b95d9d992d">IDEA Setup a Starintel server</h3>
<div class="outline-text-3" id="text-org2b875c1">
</div>
</div>
<div id="outline-container-ID-a4379236-7926-4ef3-9087-5e08ce4608fd" class="outline-3">
<h3 id="ID-a4379236-7926-4ef3-9087-5e08ce4608fd">IDEA Project: Scrape a website and store results</h3>
<div class="outline-text-3" id="text-org71bed7a">
</div>
</div>
<div id="outline-container-ID-4a65d027-6e58-47b9-a0ae-5334a39465cf" class="outline-3">
<h3 id="ID-4a65d027-6e58-47b9-a0ae-5334a39465cf">IDEA Basic SkipTrace guide</h3>
<div class="outline-text-3" id="text-orge10fec0">
</div>
</div>
</div>

<div id="outline-container-ID-725ef08c-4d55-433c-9c0d-64bca7d251f2" class="outline-2">
<h2 id="ID-725ef08c-4d55-433c-9c0d-64bca7d251f2"><span class="todo TODO">TODO</span> Guide on how to setup the enviroment</h2>
<div class="outline-text-2" id="text-org7589a47">
</div>
</div>

<div id="outline-container-ID-5758e175-38f8-4801-aaad-355f31553ab3" class="outline-2">
<h2 id="ID-5758e175-38f8-4801-aaad-355f31553ab3">Links to Stuff that made this possible</h2>
<div class="outline-text-2" id="text-orgf3eecec">
<ul class="org-ul">
<li><a href="https://couchdb.apache.org/">CouchDb</a></li>
<li><a href="2022-04-28-221119-nixos.html#ID-d0dc2504-21ff-4843-994d-e8abf1991ea0">NixOs</a></li>
<li><a href="https://nim-lang.org/">Nim Lang</a></li>
<li><a href="https://www.python.org/">Python</a></li>
<li><a href="https://www.gnu.org/software/emacs/">Emacs</a></li>
<li><a href="https://github.com/scrapinghub/splash">Splash</a></li>
<li><a href="https://github.com/hamidb80/mycouch">MyCouch</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
